// Get references to elements
const airplane = document.getElementById("airplane");
const areas = document.querySelectorAll(".drop-area");
const output = document.getElementById("output");

// Add drag and drop events
airplane.addEventListener("dragstart", dragStart);
areas.forEach(area => {
    area.addEventListener("dragover", dragOver);
    area.addEventListener("drop", dragDrop);
});

// Drag Start event
function dragStart(e) {
    e.dataTransfer.setData("text/plain", e.target.id);
}

// Drag Over event
function dragOver(e) {
    e.preventDefault();
}

// Drag Drop event
function dragDrop(e) {
    e.preventDefault();
    const droppedId = e.dataTransfer.getData("text");
    const droppedElement = document.getElementById(droppedId);
    document.body.classList.remove('bg-joy', 'bg-peace', 'bg-light', 'bg-good', 'bg-pure', 'bg-victory');
    // Handle output changes based on the drop area
    switch (e.target.id) {
        case "area1":
            output.innerText = `
أرض الفرح
شعار الأرض : «وَسَيَمْسَحُ اللهُ كُلَّ دَمْعَةٍ مِنْ عُيُونِهِمْ ، وَالْمَوْتُ لا يَكُونُ فِي مَا بَعْدُ، وَلا يَكُونُ حُزْنٌ وَلَا صُرَاخٌ وَلَا وَجَعٌ في مَا بَعْدُ، لأنَّ الأُمُورَ الأُولَى قَدْ مَضَتْ» ( رؤ ٤:٢١ )
ما قبل الفرح
وَسَيَمْسَحُ الله كُلَّ دَمْعَةٍ مِنْ عُيُونِهِمْ. الفرح الحقيقي لا يأتي إلا بعد دموع التوبة والجهاد الروحي ، فالأيدية لا يسكنها من عاش حياته على الأرض بتهوان وإستهتار بل يسكنها من جاهد ضد الخطية وبكت نفسه
باستمرار
، حفلة عظيمة يُقيمها الله لمن هم عاشوا بالدموع في حياتهم لذلك نجد الكتاب يقول لنا أن الله بذاته يمسح هذه الدموع فلم يرسل ملاك ولا رئيس ملائكة ولا أحد من القديسين بل الله نفسه يكون في إستقبال أولاده التأبين ليكلل جهادهم في السماء بفرحاً لا ينطق به ومجيد
مشاعر الله
حَوْلِي عَنِّي عَيْنَيْكِ فَإِنَّهُمَا قَدْ غَلَبَتَانِي » (نش (٦ : ٥ ) ... لقد تحدث الكتاب المقدس كثيراً عن مشاعر الله المحب إتجاه الإنسان في رحلة حياته على الأرض، فنجد أن دموع المظلومين والتأبين لا يحتملها الله الرقيق المحب للإنسان، فيطلب من عروس النشيد التي ترمز للنفوس البشرية أن تحول عيناها عنه لأن حبه العجيب لها لا يحتمل هذه الدموع ... الفـرح الحقيق هو أن نعرف حب الله العجيب لنا .
•
كيف نقتني الفرح
1- بالشكر « اشكُرُوا فِي كُلِّ شَيْءٍ ، لأَنَّ هَذِهِ هِيَ مَشِيئَةُ اللهِ (اتس ١٨:٥) ... من يشكر دائماً يُنقذ نفسه من التذمر الذي يقود للحزن والكأبة . ۲- بالتسليم « سَلَّمْنَا فَصِرْنَا نُحْمَلُ » (أع ٥:٢٧) ... من يضع حياته في يد الله الحنون لا يحزن أبداً بل يقول باستمرار كله للخير وهذه هي إرادة الله .`;
            output.style.color = "#db1ab1"; // Gold color
            document.body.classList.add('bg-joy'); // Example background image
            break;
        case "area2":
            output.innerText = `
أرض السلام
شعار الأرض : «وَسَمِعْتُ صَوْتاً عَظِيماً مِنَ السَّمَاءِ قَائِلاً: «هُوَذَا مَسْكَنُ اللهِ مَعَ النَّاسِ، وَهُوَ سَيَسْكُنُ مَعَهُمْ ، وَهُمْ يَكُونُونَ لَهُ شَعْباً. وَاللَّهُ نَفْسُهُ يَكُونُ مَعَهُمْ
إِلَها لَهُمْ» ( رؤ ۳:۲۱ )
أبديتي وملكوتي
...
هُوَذَا مَسْكَنُ اللهِ مَعَ النَّاسِ . من الطبيعي أن يقول الكتاب المقدس « هوذا مسكن الناس مع الله » لأن الأبدية هي مكان الله والبشر الأبرار هم ضيوف ربنا في الأبدية ، ولكن يقول لنا القديس يوحنا الرائي أنه سمع صوتاً عظيماً في السماء ينادي « هوذا مسكن الله مع الناس » وكأن الله يُريد أن يقول لنا جميعاً أننا أصحاب الملكوت وكل ما أعده الله لنا في الأبدية يملكنا عليه حتى صارت السماء مسكني والله نفسه هو من يسكن معي في مسكني ..
....
هل من حب مثل هذا !!!!
كيف نجد السلام
وَهُوَ سَيَسْكُنُ مَعَهُمْ ، وَهُمْ يَكُونُونَ لَهُ شَعْبا... نحن لا نجد السلام خارج المسيح إلهنا لأنه هو مصدر السلام، الإنسان الذي يحيا مع الله دائماً بواسطة الصلاة والقرأة في الكتاب المقدس وممارسة الأسرار يجد السلام يملئ كل حياته الفارق الجوهري بين السماء والأرض هو الوجود الدائم مع الله بلا إنشغال وبلا تغصب ... أنها أرضاً جديدة يمللها
ملك السلام
...

حافظ على سلامك
الخطية هي السبب الرئيسي لفقدان السلام
الداخلي، للأسباب التالية :
1- لأنها تقود الإنسان للعبودية : كقول الرب يسوع « أَجَابَهُمْ يَسُوعُ: «الْحَقِّ الْحَقُّ أَقُولُ لَكُمْ: إِنَّ كُلَّ مَنْ يَعْمَلُ الْخَطِيَّةَ هُوَ عَبْدُ لِلْخَطِيَّةِ» ( يو ٨ : ٣٤ )
أولاد الله الذين يعيشون في حياة القداسة تجدهـم أحـرار بلا قيود يمتلكون السلام والفرح ، بينما أهل العالم الذين يعيشون في الشهوات والخطايا تجدهم مقيدين بسلاسل الخطية، يجدون لذة وقتية في الخطية وبعدها لا يجدون سوى الإحباط والقلق واليأس ثم يعودون مرة آخرى للخطية وبعدها يجدون القلق .. وهكذا تمر حياتهم في ضيق وعبودية للخطية .
٢- لأنها إنفصال عن الله : يقول لنا الكتاب لا شركة للنور مع الظلمة ، فكل إنسان يحيا في الخطية لا شركة له مع الله لأنـه أصبح من أولاد إبليس كقول الكتاب ، « مَنْ يَفْعَلُ الْخَطِيَّةَ فَهُوَ
مِنْ إِبْلِيسَ لأَنَّ إِبْلِيسَ مِنَ الْبَدْءِ يُخْطِئُ» ( ايو ۳ : ۸ ) .
من يحيا في ، الخطية يفقد بنوته الله وبالتالي يفقد سلامه لأنه فقد مصدر السلام .

`;
            output.style.color = "#00FF00"; // Green color
            document.body.classList.add('bg-peace');
            break;
        case "area3":
            output.innerText = `
أرض الضياء
شعار الأرض : « وَالْمَدِينَةُ لاَ تَحْتَاجُ إلَى الشَّمْسِ وَلاَ إِلَى الْقَمَرِ لِيُضِينَا فِيهَا، لأنَّ مَجْدَ اللهِ قَدْ أَنَارَهَا، وَالْخَرُوفُ سراجُهَا » ( رو ۲۳:۲۱ )
حياة الأستنارة
...
الشمس والقمر
وَالْمَدِينَةُ لَا تَحْتَاجُ إِلَى الشَّمْسِ وَلا إِلَى الْقَمَرِ لِيُضِينَا فِيهَا . هنا يشيران للمعرفة الأرضية ... فالمعرفة هي التي تنير العقل، حينما تتحدث مع شخص مثقف بالمعرفة تجده مستنير في كلامه وتفكيره وقرارته على النقيض الشخص الفارغ من المعرفة ، ولكن في الأبدية هناك حياة مختلفة وتعاملات روحية بين البشر أساسها معرفة روحية وإستنارة إلهية، فنجد محبة الله العجيبة قد إنسكبت بقوة على البشر السمائين فصارت قلوبهم مستنيرة بالحب الإلهي وتعاملاتهم أصبحت سماوية ، تعاملات لا تعرف الذات والكبرياء ولا الحسد ولا أي أمر من مشاعر الأرضيين المضيئة بالمعرفة الأرضية الخاطئة ، فالحروب في العالم بين الناس والدول أساسها المعرفة الخاطئة التي تبحث على من يكون الأول والأعظم بينما السماء يملؤها الحب والسلام المبنيان على معرفة الرب يسوع التي تضئ الأبدية .
سراح واحد
وَالْخَرُوفُ سِرَاجُهَا ... على الأرض هناك مصادر عديدة للمعرفة والضياء فنجد الإنسان الروحي لا يستطيع أن يستغني عن المعرفة العلمية المفيدة بالإضافة للمعرفة الروحية، ولكن من يستطيع أن يزن حياته بحيث تكون معرفته بالروحيات والتسبيح لها النصيب الأعظم، تخيل معي يا عزيزي شكل العالم !!! لو كانوا كل الناجحين في الحياة من روساء دول ورجال اعمال وأطباء ومهندسين ومعلمين وغيرهم ، كلهـم مستنيرين بتعاليم المسيح ، سوف نجد بلا شك أرضاً جديدة مضيئة بمجد الله لها لمعان يُشبة السماء ... ولكن في الأبدية لا نحتاج لكل هذا


والخروف سراجها
لأن السراج الذي يُنير حياتنا وعقولنا هو المسيح إلهنا المشبع ، سراج واحد يملئنا بالطمأنينة والأفراح فلا يوجد هناك داعي للأرتباك والأنشغال بمعرفة أي أمور تساعد على تحسين مستوانا لأننا سوف نكون في أفضل حال على
الأطلاق .
من هم المستيرين ؟؟
1- النفوس الهادئة : التي تجد راحتها في الموسيقى الهادئة مثل الترانيم والتسبيح كقول الرسول « مُكَلِّمِينَ بَعْضُكُمْ بَعْضاً بِمَزَامِيرَ وَتَسَابِيحَ وَأَغَانِيَّ رُوحِيةٍ مُتَرَتِّمِينَ وَمُرَتِّلِينَ فِي قُلُوبِكُمْ لِلرَّبِّ » (أف١٩:٥)، هي نفوس مستنيرة لا تجد راحتها في الموسيقى الصاخبة والأغاني العالمية التي تُحرك الغرائز الجسدية . ٢- النفوس المحبة : التي تجد راحتها في خدمة الأخرين ولا تطلب شئ لنفسها هي نفوس مستنيرة بكلمة الله التي تقول « الْمَحَبَّةُ لَا تَطْلُبُ مَا لِنَفْسِهَا » (اکو٥:١٣)
            `;


            output.style.color = "#FF4500"; // Orange red color
            document.body.classList.add('bg-light');
            break;
        case "area4":
            output.innerText = `
الأرض الجيدة
شعار الأرض: «وَهَـؤُلاءِ هُمُ الَّذِينَ زُرِعُوا عَلَى الْأَرْضِ الْجَيْدَةِ الَّذِينَ يَسْمَعُونَ الْكَلِمَةَ وَيَقْبَلُونَهَا، وَيُثْمِرُونَ
وَاحِدٌ ثَلاثِينَ وَآخَرُ سِتِّينَ وَآخَرُ مِئَةً» (مر٢٠:٤)
مثل الزارع (مر ٢٠١٤
وَابْتَدَأَ أَيْضاً يُعَلِّمُ عِنْدَ الْبَحْرِ، فَاجْتَمَعَ إِلَيْهِ جَمْعُ كَثِيرٌ حَتَّى إِنَّهُ دَخَلَ السَّفِينَةٌ وَجَلَسَ عَلَى الْبَحْرِ، وَالْجَمْعُ كُلُّهُ كَانَ عِنْدَ الْبَحْرِ عَلَى الأَرْضِ ٢٠ فَكَانَ يُعَلِّمُهُمْ كَثِيراً بِأَمْثَالٍ، وَقَالَ لَهُمْ فِي تعْلِيمِهِ: ۳اسْمَعُوا هُوَذَا الزَّارِعُ قَدْ خَرَجَ لِيَزْرَعَ ، وَفِيمَا هُوَ يَزْرَعُ سَقَطَ بَعْضُ عَلَى الطَّرِيقِ، فَجَاءَتْ طيور السَّمَاءِ وَأَكَلَتْهُ . ٥ وَسَقَطَ آخَرُ عَلَى مَكَانٍ مُحْجِرٍ، حَيْثُ لَمْ تَكُنْ لَهُ تُرْبَةٌ كَثِيرَةٌ فَنَبَتَ حَالاً إِذْ لَمْ يَكُنْ لَهُ عُمْقُ أَرْضِ وَلَكِنْ لَمَّا أَشْرَقَتِ الشَّمْسُ احْتَرَقَ، وَإِذْ لَمْ يَكُنْ لَهُ أَصْلٌ جَفٌ. وَسَقَطَ آخَرُ فِي الشَّوْكِ، فَطَلَعَ الشَّوْلُ وَخَنَقَهُ فَلَمْ يُعْطِ ثَمَراً. ٨ وَسَقَطَ آخَرُ فِي الْأَرْضِ الْجَيْدَةِ، فَأَعْطَى ثَمَراً يَصْعَدُ وَيَنْمُو، فَأَتَى وَاحِدٌ بِثَلاثِينَ وَآخَرُ بِسِتِّينَ وَآخَرُ بِمِنْةٍ». وتُمْ قَالَ لَهُمْ: «مَنْ لَهُ أَذْنَانِ لِلسَّمْعِ، فَلْيَسْمَعْاوَلَمَّا كَانَ وَحْدَهُ سَأَلَهُ الَّذِينَ حَوْلَهُ مَعَ الإِثْنَيْ عَشْرَ عَنِ الْمَثَلِ افَقَالَ لَهُمْ: «قَدْ أُعْطِيَ لَكُمْ أَنْ تَعْرِفُوا سِرَّ مَلَكُوتِ اللهِ، وَأَمَّا الَّذِينَ هُمْ مِنْ خَارِجَ فَبِالأَمْثَالِ يَكُونُ لَهُمْ كُلُّ شيء، ١٢ لِكَيْ يُبْصِرُوا مُبْصِرِينَ وَلا يَنْظُرُوا وَيَسْمَعُوا سَامِعِينَ وَلَا يَفْهَمُوا، لِئَلَّا يَرْجِعُوا فَتُغْفَرَ لَهُمْ خَطَايَاهُمْ » ۱۳۰تُمْ قَالَ لَهُمْ : «أَمَا تَعْلَمُونَ هَذَا الْمَثَلَ : فَكَيْفَ تَعْرِفُونَ جَمِيعَ الأَمْثَالِ ١٤٢ الزَّارِعُ يَزْرَعُ الْكَلِمَةَ. ١٥ وَهَؤُلَاءِ هُمُ الَّذِينَ عَلَى الطَّرِيقِ حَيْثُ تُزْرَعُ الْكَلِمَةُ، وَحِينَمَا يَسْمَعُونَ يَأْتِي الشَّيْطَانُ لِلْوَقْتِ وَيَنْزِعُ الْكَلِمَةَ الْمَزْرُوعَةً فِي قُلُوبِهِمْ . ١٦ وَهَؤُلَاءِ كَذَلِكَ هُمُ الَّذِينَ زُرِعُوا عَلَى الْأَمَاكِنِ الْمُحْجِرَةِ الَّذِينَ حِينَمَا يَسْمَعُونَ الْكَلِمَةَ يَقْبَلُونَهَا لِلْوَقْتِ بِفَرَحِ، ١٧ وَلَكِنْ لَيْسَ لَهُمْ أَصْلُ فِي ذَوَاتِهِمْ، بَلْ هُمْ إِلَى حِينٍ، فَبَعْدَ ذَلِكَ إِذَا حَدَثَ ضِيقُ أَوِ اضْطِهَادٌ مِنْ أَجْلِ الْكَلِمَةِ فَلِلْوَقْتِ يَعْتُرُونَ. ۱۸ وَهَؤُلاءِ هُمُ الَّذِينَ زُرِعُوا بَيْنَ الشَّوْكِ: هَؤُلاءِ هُمُ الَّذِينَ يَسْمَعُونَ الْكَلِمَةَ ۱۹ وَهُمُومُ هَذَا الْعَالَمِ وَغُرُورُ الْغِنَى وَشَهَوَاتُ سَائِرِ الأَشْيَاءِ تَدْخُلُ وَتَخْنُقُ الْكَلِمَةَ فَتَصِيرُ بلا ثمر ٢٠ وَهَؤُلاءِ هُمُ الَّذِينَ زُرِعُوا عَلَى الأَرْضِ الْجَيْدَةِ: الَّذِينَ يَسْمَعُونَ الْكَلِمَةَ وَيَقْبَلُونَهَا، وَيُلْمِرُونَ: وَاحِدٌ ثَلاثِينَ وَآخَرُ سِتِّينَ وَآخَرُ مِنْةٌ».

                معاني تهمك السفينة والبحر: السفينة تشير لحياتنا على الأرض، والبحر يشير إلى العالم المضطرب، وقول الكتاب في مثل الزارع أن الرب يسوع ركب السفينة وجلس على البحر، يُ شير إلى وجود الله الدائم في حياة أولاده خرج الزارع: الزارع هو ربنا يسوع، وتعبير خرج الزارع يشير إلى تجسد الله« نحن خرجنا من الفردوس، فخرج إلينا ذاك الذي لا ينفصل عن أبيه ليردنا نحن الخطاة إلى حضن الآب بغفران خطايانا وإتحادنا فيه القديس يوحنا ذهبي الفم تعبير "خرج"
                يعني مبادرة الله بالحب.فهو دائما كمن يخرج إلى الإنسان بالحب، إذ وقف الإنسان في ضعفه عاجزا عن الالتقاء مع إلهه والدخول إليه.البذار: هي كلمة الله(كلام الكتاب المقدس)، التي قدمها لنـا كبــذار الحياة جديدة ومن يقبلها ويعمل بها تنمو وتثمر داخله لتصنع ملكوت ذكر لنا الرب يسوع في هذا المثل أربع أنواع من الأراضي التي الأرض: •
                وضعت بها كلمة الله(الطريق - الحجرية - الشوك - الجيدة).رقم::يُ شير لحياتنا الزمنية(حيث أن العام يمر في حياتنا بعد أنقضاء أربع فصول« الربيع والصيف والخريف والشتاء») والمكان الذي نستطيع أن نتحرك فيه أيام حياتنا يحددها أربع إتجاهات« الشمال والجنوب والشرق والغرب»....إذاً رقم٤ يُ شير لحياتنا الأرضية.معوقات الحياة الروحية ذكر لنا الرب يسوع في هذا المثل أربع أنواع من الأراضي، وهذه الأراضي الأربعة تُ شير لحالتنا الروحية المتذبذبة من وقت لأخر، وهنا نرى ثلاثة أمور تعوق قبولنا لكلمة الله وهم:
                1 - العلاقات الكثيرة مع الأخرين(الطريق): الطريق ليس له سور يحميه بل كل ما يضع الله كلمته به تأتي الطيور وتأكل البذار بسرعة وقبل أي إنبات في التربة، وهذا هو الحال مع الشخص الذي يُ قيم علاقات كثيرة


                معوقات الحياة الروحية مع الأخرين بدون حدود لهذه العلاقات، فتصبح حياته مثل الطريق، ويفقد خصوصياته ويصبح مدوسا من الآخرين، أو مثل من يُ قدم أسراره الخاصة الخاصة وقدس اقداس حياته على مواقع التواصل ليشاهدها الألف من الناس فيفقد أيضا خصوصيته، وتتحول حياته من جنة مغلقة إلى طريق تدوسه أقدام الكثيرين..فلنحذر جميعاً من هذا الأنفلات في العلاقات حتى تصبح حياتنا مثمرة بكلمة الله.العباد السطحية الأرض الحجرية): سقطت كلمة الله على الأرض الحجرية كانت هذه الأرضة تمتلك طبقة رقيقة من الطين فنبتت فيها البذار ولكن لضعف وسطحية التربة مات الزرع من حرارة الشمس...وهذا هو حال الإنسان السطحي في عبادته يمارس الأسرار بدون فهم ويحضر الإجتماعات بدون استعداد للتوبة بل يحضر لمجرد التسلية أو التجمع مع الأصدقاء،
            السطحية في العبادة لا تقود للثمر بل هي عائق كبير لعمل الله في حياتنا
                -
                العقل المشتت الأرض المملؤة أشواك: سقطت كلمة الله على أرض بها أشواك وبعد أن نبتت لم تستطيع أن تحيا لأن الشوك خنقها، هذه الأشواك قال عنها ربنا يسوع أنها هموم العالم الكثيرة التي تشتت الإنسان عن حياته الروحية...وهذا هو الحال معنا حينما نقف في الصلاة بعقل مشتت وبدون تركيز أو عندما نحضر الإجتماعات ونحن منشغلين بالحديث مع الأخرين غير مهتمين بسماع كلمة الله.
            لنا رجاء في محبة الله
            ذكر لنا الرب يسوع في هذا المثل أربع أنواع من الأراضي، وهذه الأراضي الأربعة تُ شير لحالتنا الروحية المتذبذبة من وقت لآخر، ولكن ما يملئنا رجاء أنها أنتهت بالأرض الجيدة التي قبلت كلمة الله واعطت ثمراً، وفي الحقيقة هذه هي إرادة الله المحب للبشر أن تنتهي حياتنا على الأرض ونحن في حالة جيدة ومثمرة بالفضائل ثلاثين وستين ومائة، والعجيب أيضا في محبة الله لنا أنه يقبل منا أي ثمر حتى لو كان ضعيف مثل أصحاب الثلاثين بالمئة أو متوسط مثل أصحاب الستين بالمائة،


                `;
            output.style.color = "#228B22"; // Forest green color
            document.body.classList.add('bg-good');
            break;
        case "area5":
            output.innerText = `
أرض النقاء
شعار الأرض: « وَلَنْ يَدْخُلَهَا شَيْءٌ دَنِسٌ وَلا مَا يَصْنَعُ رجساً وَكَذِباً، إلا الْمَكْتُوبِينَ فِي سِفْرِ حَيَاةِ الْحَمَلِ » ( رؤ
( ۲۷:۲۱
المكتوبين في سفر الحياة
إلا الْمَكْتُوبِينَ فِي سِفْرِ حَيَاةِ الْحَمَلِ ... يذكر لنا سفر الرؤيا أنه يوجد سفران في الأبدية إحداهما مكتوب فيه كل أعمال الإنسان وأخر يُدعى سفر الحياة مكتوب فيه أسماء أبناء الملكوت الأنقياء « وَرَأَيْتُ الأَمْوَات صِغَاراً وكباراً وَاقِفِينَ أَمَامَ اللهِ، وَانْفَتَحَتْ أَسْفَارٌ. وَانْفَتَحَ سِفَرٌ آخَرُ هُوَ سفْرُ الْحَيَاةِ، وَدِينَ الأَمْوَاتُ مِمَّا هُوَ مَكْتُوبٌ في الأَسْفَارِ بِحَسَبِ أَعْمَالِهِمْ»
(رؤ۱۲:۲۰)
لكل إنسان سفر مكتوب فيه كل أعماله بل وأفكاره ... ذكر لنا الكتاب المقدس هذا الأمر الخطير حتى نحترس في حياتنا وتصرفاتنا ، لأن كل ما يفعله الإنسان محفوظ له ليوم الدينونة « فَإِذا كُلَّ وَاحِدٍ مِنا سَيُعْطِي عَنْ نَفْسِهِ حِسَاباً لِلَّهِ » (رو١٢:١٤)
المنقذ الوحيد
إن الأمر بهذه الدقة فمن يستطيع أن يخلص ، لأن الكتاب نفسه يذكر أنه لا يوجد إنسان بلا خطية حتى لو كانت حياته يوماً واحداً على الأرض ، فكيف نخلص إذا ؟!! ، لقد أجاب الرب يسوع عن هذا الأمر في إنجيلـه قائلاً « كَلاا أقُولُ لَكُمْ. بَلْ إِنْ لَمْ تَتُوبُوا فَجَمِيعُكُمْ كَذَلِكَ تَهْلِكُونَ :
(لو ٣:١٣)
فحياة التوبة هي المنقذ الوحيد ، لذلك أهتم الرب يسوع في بداية تأسيس الكنيسة أن يُقيم سر التوبة والاعتراف وسلطان الحل والفغران « فَقَالَ لَهُمْ يَسُوعُ أَيْضاً: «سلام لَكُمْ كَمَا أَرْسَلَنِي الآبُ أُرْسِلُكُمْ أَنَا». وَلَمَّا قَالَ هَذَا نَفَخَ وَقَالَ لَهُمُ : «اقْبَلُوا الرُّوحَ الْقُدِّسَ مَنْ غَفَرْتُمْ خَطَايَاهُ تُغْفَرُ لَهُ، وَمَنْ أَمْسَكْتُمْ خَطَايَاهُ أُمْسِكَتْ» (یو۲۰ : ۲۱-۲۳)`;
            output.style.color = "#0678e2"; // Sky blue color
            document.body.classList.add('bg-pure');
            break;
        case "area6":
            output.innerText = `
            
أرض النصرة
شعار الأرض : « مَنْ يَغْلِبُ يَرِثُ كُلَّ شَيْءٍ، وَأَكُونُ لَهُ إِلَهَا وَهُوَ يَكُونُ لِي ابْناً » ( رؤ ۷:۳۱ )
الميراث العجيب
مَنْ يَغْلِبُ يَرِثُ كُلَّ شَيْءٍ ... على الأرض إذا أراد الأب أن يعطي أبنائه ميراث لا يجد طريقة سوى أن يقسم الميراث بالتساوي بينهم ، ولكن العجيب في الأبدية أن أبينا السماوي حينما يعطينا الميراث الأبدي ، يُعطي لكل إنسان كُلَّ شَيْء !!!! ... إن عقلنا البشري المحدود لا يستطيع تفسير هذه العبارة ولكن ما يملئنا رجاء هو أن الله يؤكد لنا جميعاً أن الأبدية العظيمة المجيدة معد لنا إذا غلبنا وأنتصرنا على الخطية .
من هم المنتصرين ؟!
1- الأطهار ... الذين غلبوا شهوات الجسد ، وحافظوا على اجسادهم كمذبح مقدس لسكن الله في داخله هم الغالبين أمام الله .
...
الذين غلبوا الكبرياء وسلكوا بإتضاع مع الأخرين
٢- المتواضعين وغلبوا الذات وقدموا غيرهم في الكرامة هم الغالبين أمام الله .
...
٣- المجاهدين الذين تعبوا من أجل خلاص أنفسهم بالسهر والصلاة والتسبيح هم الغالبين أمام الله .
٤- البناؤن.
...
الذين غلبوا الكسل واللامبالاه وتعبوا في بناء الملكوت
بخدمتهم في الكنيسة وحبهم لخلاص الأخرين هم الغالبين أمام الله .
اختر لك يا عزيزي طريقاً روحياً لكي تحيا فيه بالفضيلة حتى
تكون من المنتصرين سكان السماء`;
            output.style.color = "#FF6347"; // Tomato color
            document.body.classList.add('bg-victory');
            break;
        default:
            output.innerText = "اسحب الطائرة إلى منطقة.";
            output.style.color = "#000000"; // Default color
            document.body.style.backgroundImage = "none";
            break;
    }
}